In [59]:
import boto3
import pandas as pd
import numpy as np
import configparser
import psycopg2
import mysql.connector
from datetime import datetime, timedelta

### Leemos archivo de configuración y credenciales de base de datos MySQL

In [60]:
config = configparser.ConfigParser()
config.read('config.cfg')

['config.cfg']

In [61]:
aws_rds_conn = boto3.client('rds', aws_access_key_id=config.get('IAM', 'ACCESS_KEY'),
                            aws_secret_access_key=config.get('IAM', 'SECRET_KEY'),
                            region_name='us-east-1')

### Verificamos instancias disponibles para el usuario

In [62]:
rds_instances_ids = []

aws_response = aws_rds_conn.describe_db_instances()

for response in aws_response['DBInstances']:
    rds_instances_ids.append(response['DBInstanceIdentifier'])
    
print(f"Instances disponibles: {rds_instances_ids}")

Instances disponibles: ['dw-galileo-final', 'transacc-galileo-final']

### Creamos instancia de base de datos en AWS - MySQL

In [63]:
try:
    response = aws_rds_conn.create_db_instance(
        DBInstanceIdentifier=config.get('DATAWAREHOUSE', 'DB_INSTANCE_ID'),
        DBName=config.get('DATAWAREHOUSE', 'DB_NAME'),
        MasterUsername=config.get('DATAWAREHOUSE', 'DB_USERNAME'),
        MasterUserPassword=config.get('DATAWAREHOUSE', 'DB_PASSWORD'),
        Port=int(config.get('DATAWAREHOUSE', 'DB_PORT')),
        DBInstanceClass='db.t3.micro',
        Engine='mysql',
        PubliclyAccessible=True,
        AllocatedStorage=10,
        VpcSecurityGroupIds=[config.get('VPC', 'SECURITY_GROUP')]
    )
    
    print(response)
except aws_rds_conn.exceptions.DBInstanceAlreadyExistsFault:
    print("La instancia ya existe")
except Exception as ex:
    print("Error!!!", ex)

La instancia ya existe

In [64]:
try:
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('DATAWAREHOUSE', 'DB_INSTANCE_ID'))
    RDS_HOSTNAME = instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME)
except Exception as ex:
    print("Error!!!", ex)

dw-galileo-final.czy2eeg8ibjx.us-east-1.rds.amazonaws.com

### Nos conectamos a la base de datos y creamos las tablas

In [65]:
import sql_datawarehouse

In [66]:
try:
    db_mysql_conn = mysql.connector.connect(
        database=config.get('DATAWAREHOUSE', 'DB_NAME'),
        user=config.get('DATAWAREHOUSE', 'DB_USERNAME'),
        password=config.get('DATAWAREHOUSE', 'DB_PASSWORD'),
        port=config.get('DATAWAREHOUSE', 'DB_PORT'),
        host=RDS_HOSTNAME
    )

    cursor = db_mysql_conn.cursor()
    cursor.execute(sql_datawarehouse.DDL_QUERY, multi=True)
    #db_mysql_conn.commit()
    print("Data Warehouse Creado Exitosamente")
except Exception as ex:
    print("Error!!!", ex)

Data Warehouse Creado Exitosamente

### Nos conectamos a la base de datos de Transaccional de Postgres

In [67]:
try:
    instance = aws_rds_conn.describe_db_instances(DBInstanceIdentifier=config.get('TRANSACCIONAL', 'DB_INSTANCE_ID'))
    RDS_HOSTNAME_TRANSAC = instance.get('DBInstances')[0].get('Endpoint').get('Address')
    print(RDS_HOSTNAME_TRANSAC)
except Exception as ex:
    print("Error!!!", ex)

transacc-galileo-final.czy2eeg8ibjx.us-east-1.rds.amazonaws.com

### Establecemos los drivers de MySQL y Postgres

In [68]:
mysql_driver = f"""mysql+pymysql://{config.get('DATAWAREHOUSE', 'DB_USERNAME')}:{config.get('DATAWAREHOUSE', 'DB_PASSWORD')}@{RDS_HOSTNAME}:{config.get('DATAWAREHOUSE', 'DB_PORT')}/{config.get('DATAWAREHOUSE', 'DB_NAME')}"""  
mysql_driver

'mysql+pymysql://admin_mysql:fEqesTlrlHACuvUVo0aPhospa@dw-galileo-final.czy2eeg8ibjx.us-east-1.rds.amazonaws.com:3306/dw_galileo'

In [69]:
postgres_driver = f"""postgresql://{config.get('TRANSACCIONAL', 'DB_USERNAME')}:{config.get('TRANSACCIONAL', 'DB_PASSWORD')}@{RDS_HOSTNAME_TRANSAC}:{config.get('TRANSACCIONAL', 'DB_PORT')}/{config.get('TRANSACCIONAL', 'DB_NAME')}"""
postgres_driver

'postgresql://admin_postgres:jl8oVe4OqotuhoxecAZlvoT75@transacc-galileo-final.czy2eeg8ibjx.us-east-1.rds.amazonaws.com:5432/transaccional_galileo'

### Dimensión Articulo

In [70]:
sql_query = 'SELECT * FROM articulo;'
df_articulos = pd.read_sql(sql_query, postgres_driver)
df_articulos.head()

,id_articulo,id_categoria,codigo,nombre,precio_venta,stock,descripcion,imagen,estado
0,1,4,5985536367993,beautiful,7421.61,18,Argue into little.,threat.png,0
1,2,5,8794419211707,letter,2412.32,11,Employee study.,pull.png,1
2,3,4,8444155389412,someone,7655.17,7,Own participant.,if.png,1
3,4,5,5893375833688,technology,6675.76,8,Mrs long issue.,crime.png,1
4,5,1,3517759563665,hotel,7630.21,15,Question respond.,range.png,1

In [71]:
sql_query = 'SELECT * FROM categoria;'
df_categorias = pd.read_sql(sql_query, postgres_driver)
df_categorias.head()

   id_categoria      nombre descripcion estado
0             1        Ropa        Ropa      0
1             2     Zapatos     Zapatos      1
2             3   Celulares   Celulares      0
3             4       Hogar       Hogar      1
4             5  Ferreteria  Ferreteria      0

In [72]:
dimArticulos = df_articulos.merge(df_categorias, on='id_categoria', how='inner', suffixes=('', '_categoria'))
dimArticulos.head()

,id_articulo,id_categoria,codigo,nombre,precio_venta,stock,descripcion,imagen,estado,nombre_categoria,descripcion_categoria,estado_categoria
0,1,4,5985536367993,beautiful,7421.61,18,Argue into little.,threat.png,0,Hogar,Hogar,1
1,3,4,8444155389412,someone,7655.17,7,Own participant.,if.png,1,Hogar,Hogar,1
2,7,4,8117241019073,his,3510.71,11,Outside computer no.,turn.png,1,Hogar,Hogar,1
3,14,4,8187266988869,respond,4983.81,11,Model include.,poor.png,1,Hogar,Hogar,1
4,17,4,8602883941795,across,9799.57,16,Capital happy yeah.,answer.png,1,Hogar,Hogar,1

In [73]:
dimArticulos.drop(['id_categoria', 'precio_venta', 'stock', 'descripcion', 'imagen', 'estado', 'descripcion_categoria', 'estado_categoria'], axis=1,  inplace=True)
dimArticulos.head()

   id_articulo         codigo     nombre nombre_categoria
0            1  5985536367993  beautiful            Hogar
1            3  8444155389412    someone            Hogar
2            7  8117241019073        his            Hogar
3           14  8187266988869    respond            Hogar
4           17  8602883941795     across            Hogar

In [74]:
dimArticulos.rename(columns={'nombre_categoria': 'categoria'}, inplace=True)
dimArticulos.head()

   id_articulo         codigo     nombre categoria
0            1  5985536367993  beautiful     Hogar
1            3  8444155389412    someone     Hogar
2            7  8117241019073        his     Hogar
3           14  8187266988869    respond     Hogar
4           17  8602883941795     across     Hogar

### Dimensión Cliente

In [75]:
sql_query = 'SELECT * FROM persona;'
df_clientes = pd.read_sql(sql_query, postgres_driver)
df_clientes.head()

,id_persona,tipo_persona,nombre,tipo_documento,num_documento,direccion,telefono,email
0,1,Individual,Katherine Juarez,DPI,5872799,6047 Heidi Flat,38124312,ramosann@gmail.com
1,2,Individual,Amy Delgado,Pasaporte,4901233,817 Watkins Mountain Apt. 515,26201367,samantha42@hotmail.com
2,3,Juridica,Nicholas Cabrera,DPI,3737374,26964 Odom Tunnel,2068120,sfreeman@hotmail.com
3,4,Individual,Jessica Salas,Pasaporte,3483418,47872 George Forges Apt. 371,86769755,ldonaldson@yahoo.com
4,5,Individual,Christopher Porter,DPI,9968455,53843 Peterson Views Suite 396,88031168,devinshaw@hotmail.com

In [76]:
dimClientes = df_clientes
dimClientes.drop(['tipo_documento', 'num_documento', 'direccion', 'telefono', 'email'], axis=1, inplace=True)
dimClientes.head()

   id_persona tipo_persona              nombre
0           1   Individual    Katherine Juarez
1           2   Individual         Amy Delgado
2           3     Juridica    Nicholas Cabrera
3           4   Individual       Jessica Salas
4           5   Individual  Christopher Porter

In [77]:
dimClientes.rename(columns={'id_persona': 'id_cliente'}, inplace=True)
dimClientes.head()

   id_cliente tipo_persona              nombre
0           1   Individual    Katherine Juarez
1           2   Individual         Amy Delgado
2           3     Juridica    Nicholas Cabrera
3           4   Individual       Jessica Salas
4           5   Individual  Christopher Porter

### Dimensión Usuario

In [78]:
sql_query = 'SELECT * FROM usuario;'
df_usuarios = pd.read_sql(sql_query, postgres_driver)
df_usuarios.head()

,id_usuario,id_rol,nombre,tipo_documento,num_documento,direccion,telefono,email,clave,estado
0,1,3,Robert Silva,DPI,6924350,194 Christina Corners Suite 644,39180465,reginaritter@hotmail.com,rRBlgYwElDffoCfjNlFX,0
1,2,3,Taylor Hill,Pasaporte,1874165,427 Thomas Isle,36251169,marcusbeltran@yahoo.com,UKPLjhgqzAIMvdEcbdHb,1
2,3,2,Mike Lopez,DPI,555088,487 Stephanie Spur,81847032,butlerstephanie@hotmail.com,juuVJJqklCdurKEbYZTj,1
3,4,3,Jason Aguilar,Pasaporte,8547583,85382 Katherine Corners Apt. 597,52795946,dbryan@hotmail.com,BzopGVoNKSyfxZpXTqkJ,1
4,5,1,Mallory Caldwell,DPI,1437542,527 Jones Brook,10615734,peter68@gmail.com,gIJxiOPWclYJCMidVvWO,1

In [79]:
sql_query = 'SELECT * FROM rol;'
df_roles = pd.read_sql(sql_query, postgres_driver)
df_roles.head()

   id_rol      nombre     descripcion estado
0       1     Cliente  Cliente Normal      1
1       2     Gerente   Administrador      1
2       3  Supervisor      Supervisor      1

In [80]:
dimUsuarios = df_usuarios.merge(df_roles, on='id_rol', how='inner', suffixes=('', '_rol'))
dimUsuarios.head()

,id_usuario,id_rol,nombre,tipo_documento,num_documento,direccion,telefono,email,clave,estado,nombre_rol,descripcion,estado_rol
0,1,3,Robert Silva,DPI,6924350,194 Christina Corners Suite 644,39180465,reginaritter@hotmail.com,rRBlgYwElDffoCfjNlFX,0,Supervisor,Supervisor,1
1,2,3,Taylor Hill,Pasaporte,1874165,427 Thomas Isle,36251169,marcusbeltran@yahoo.com,UKPLjhgqzAIMvdEcbdHb,1,Supervisor,Supervisor,1
2,4,3,Jason Aguilar,Pasaporte,8547583,85382 Katherine Corners Apt. 597,52795946,dbryan@hotmail.com,BzopGVoNKSyfxZpXTqkJ,1,Supervisor,Supervisor,1
3,7,3,Hunter Carr,DPI,9792396,20009 Melissa Center,42767490,madeline36@gmail.com,pQOItLGwqVkHQiMJjMrh,1,Supervisor,Supervisor,1
4,9,3,William Martin,DPI,7173300,413 Jenna Junctions Apt. 712,80875486,angela05@hotmail.com,VFsJHPXfxqXrNsECFidv,1,Supervisor,Supervisor,1

In [81]:
dimUsuarios.drop(['id_rol', 'tipo_documento', 'num_documento', 'direccion', 'telefono', 'email', 'clave', 'descripcion', 'estado_rol'], axis=1, inplace=True)
dimUsuarios.head()

   id_usuario          nombre estado  nombre_rol
0           1    Robert Silva      0  Supervisor
1           2     Taylor Hill      1  Supervisor
2           4   Jason Aguilar      1  Supervisor
3           7     Hunter Carr      1  Supervisor
4           9  William Martin      1  Supervisor

In [82]:
dimUsuarios.rename(columns={'nombre_rol': 'rol'}, inplace=True)
dimUsuarios.head()

   id_usuario          nombre estado         rol
0           1    Robert Silva      0  Supervisor
1           2     Taylor Hill      1  Supervisor
2           4   Jason Aguilar      1  Supervisor
3           7     Hunter Carr      1  Supervisor
4           9  William Martin      1  Supervisor

### Dimensión de tiempo

In [83]:
# Crear una lista de fechas desde '2020-01-01' hasta la fecha actual
fecha_inicio = datetime(2020, 1, 1)
fecha_actual = datetime.now()
lista_fechas = pd.date_range(start=fecha_inicio, end=fecha_actual, freq='D')
    
dimFechas = pd.DataFrame({'full_date': lista_fechas})
    
dimFechas.head()

   full_date
0 2020-01-01
1 2020-01-02
2 2020-01-03
3 2020-01-04
4 2020-01-05

In [84]:
dimFechas['id_date'] = pd.DatetimeIndex(dimFechas['full_date']).strftime('%Y%m%d')
dimFechas['year'] = pd.DatetimeIndex(dimFechas['full_date']).isocalendar().year.tolist()
dimFechas['month'] = pd.DatetimeIndex(dimFechas['full_date']).month
dimFechas['quarter'] = pd.DatetimeIndex(dimFechas['full_date']).quarter
dimFechas['day'] = pd.DatetimeIndex(dimFechas['full_date']).isocalendar().day.tolist()
dimFechas['week'] = pd.DatetimeIndex(dimFechas['full_date']).isocalendar().week.tolist()
dimFechas['day_name'] = dimFechas['full_date'].dt.day_name().tolist()
dimFechas['day_of_week'] = pd.DatetimeIndex(dimFechas['full_date']).dayofweek
dimFechas['weekday_flag'] = dimFechas['day_of_week'].apply(lambda x: 'Weekend' if x > 5 else 'Weekday')
dimFechas['month_name'] = dimFechas['full_date'].dt.month_name().tolist()
dimFechas.head()

,full_date,id_date,year,month,quarter,day,week,day_name,day_of_week,weekday_flag,month_name
0,2020-01-01,20200101,2020,1,1,3,1,Wednesday,2,Weekday,January
1,2020-01-02,20200102,2020,1,1,4,1,Thursday,3,Weekday,January
2,2020-01-03,20200103,2020,1,1,5,1,Friday,4,Weekday,January
3,2020-01-04,20200104,2020,1,1,6,1,Saturday,5,Weekday,January
4,2020-01-05,20200105,2020,1,1,7,1,Sunday,6,Weekend,January

### Creamos la tabla de hechos

In [85]:
sql_query = 'SELECT * FROM venta;'
df_ventas = pd.read_sql(sql_query, postgres_driver)
df_ventas.head()

,id_venta,id_cliente,id_usuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado
0,1,45,27,Recibo,D3-9503,50737,2021-03-25,83.13,8313.0,0
1,2,9,58,Recibo,P1-5632,99969,2021-10-16,74.46,7446.0,1
2,3,58,15,Recibo,x3-9179,90730,2021-12-24,29.71,2971.0,1
3,4,58,8,Factura,f8-5907,9729,2022-01-11,81.99,8199.0,1
4,5,19,45,Recibo,B6-4754,51095,2023-01-21,89.88,8988.0,1

In [86]:
sql_query = 'SELECT * FROM detalle_venta;'
df_detalle_ventas = pd.read_sql(sql_query, postgres_driver)
df_detalle_ventas.head()

   id_detalle_venta  id_venta  id_articulo  cantidad   precio  descuento
0                 1         1           13         2  5121.90      51.22
1                 2         2           30         1  7421.61       0.00
2                 3         3            3         1   440.32       0.00
3                 4         4            5         3  7655.17      76.55
4                 5         5           28         2  9431.65       0.00

In [87]:
ventas_fact = df_ventas.merge(df_detalle_ventas, on='id_venta', how='inner', suffixes=('', '_det'))
ventas_fact.head()

,id_venta,id_cliente,id_usuario,tipo_comprobante,serie_comprobante,num_comprobante,fecha,impuesto,total,estado,id_detalle_venta,id_articulo,cantidad,precio,descuento
0,1,45,27,Recibo,D3-9503,50737,2021-03-25,83.13,8313.0,0,1,13,2,5121.90,51.22
1,2,9,58,Recibo,P1-5632,99969,2021-10-16,74.46,7446.0,1,2,30,1,7421.61,0.00
2,3,58,15,Recibo,x3-9179,90730,2021-12-24,29.71,2971.0,1,3,3,1,440.32,0.00
3,4,58,8,Factura,f8-5907,9729,2022-01-11,81.99,8199.0,1,4,5,3,7655.17,76.55
4,5,19,45,Recibo,B6-4754,51095,2023-01-21,89.88,8988.0,1,5,28,2,9431.65,0.00

In [88]:
ventas_fact['total'] = ventas_fact['cantidad'] * ventas_fact['precio']
ventas_fact.drop(['tipo_comprobante', 'serie_comprobante', 'num_comprobante', 'impuesto', 'id_detalle_venta', 'cantidad', 'precio'], axis=1, inplace=True)
ventas_fact.head()

,id_venta,id_cliente,id_usuario,fecha,total,estado,id_articulo,descuento
0,1,45,27,2021-03-25,10243.80,0,13,51.22
1,2,9,58,2021-10-16,7421.61,1,30,0.00
2,3,58,15,2021-12-24,440.32,1,3,0.00
3,4,58,8,2022-01-11,22965.51,1,5,76.55
4,5,19,45,2023-01-21,18863.30,1,28,0.00

### Insertamos la data de cada Dimensión en el Data Warehouse

#### Dimensión de Articulos

In [89]:
dimArticulos.to_sql('dim_articulo', mysql_driver, index=False, if_exists='append')

30

### Dimensión de Clientes

In [90]:
dimClientes.to_sql('dim_cliente', mysql_driver, index=False, if_exists='append')

64

### Dimensión de Fechas

In [91]:
dimFechas.to_sql('dim_fecha', mysql_driver, index=False, if_exists='append')

1563

### Dimensión de Usuarios

In [92]:
dimUsuarios.to_sql('dim_usuario', mysql_driver, index=False, if_exists='append')

62

### Construimos la tabla de hechos

In [93]:
sql_query = 'SELECT * FROM dim_articulo;'
df_dim_articulos = pd.read_sql(sql_query, mysql_driver)
df_dim_articulos.head()

   sk_articulo  id_articulo         codigo     nombre categoria
0            1            1  5985536367993  beautiful     Hogar
1            2            3  8444155389412    someone     Hogar
2            3            7  8117241019073        his     Hogar
3            4           14  8187266988869    respond     Hogar
4            5           17  8602883941795     across     Hogar

In [94]:
df_venta_fact_dim_articulos = ventas_fact.merge(df_dim_articulos, on='id_articulo', how='inner', suffixes=('', '_articulo'))
df_venta_fact_dim_articulos.head()

,id_venta,id_cliente,id_usuario,fecha,total,estado,id_articulo,descuento,sk_articulo,codigo,nombre,categoria
0,1,45,27,2021-03-25,10243.80,0,13,51.22,17,0251392071288,treat,Ropa
1,26,20,26,2021-02-27,3353.78,1,13,0.00,17,0251392071288,treat,Ropa
2,32,31,11,2021-06-17,518.79,1,13,0.00,17,0251392071288,treat,Ropa
3,51,12,31,2023-12-19,2834.84,0,13,0.00,17,0251392071288,treat,Ropa
4,66,57,19,2023-02-04,13959.54,1,13,0.00,17,0251392071288,treat,Ropa

In [95]:
df_venta_fact_dim_articulos.drop(columns=['id_articulo', 'codigo', 'nombre', 'categoria'], axis=1, inplace=True)
df_venta_fact_dim_articulos.head()

,id_venta,id_cliente,id_usuario,fecha,total,estado,descuento,sk_articulo
0,1,45,27,2021-03-25,10243.80,0,51.22,17
1,26,20,26,2021-02-27,3353.78,1,0.00,17
2,32,31,11,2021-06-17,518.79,1,0.00,17
3,51,12,31,2023-12-19,2834.84,0,0.00,17
4,66,57,19,2023-02-04,13959.54,1,0.00,17

In [96]:
sql_query = 'SELECT * FROM dim_cliente;'
df_dim_clientes = pd.read_sql(sql_query, mysql_driver)
df_dim_clientes.head()

   sk_cliente  id_cliente              nombre tipo_persona
0           1           1    Katherine Juarez   Individual
1           2           2         Amy Delgado   Individual
2           3           3    Nicholas Cabrera     Juridica
3           4           4       Jessica Salas   Individual
4           5           5  Christopher Porter   Individual

In [97]:
df_venta_fact_dim_clientes = df_venta_fact_dim_articulos.merge(df_dim_clientes, on='id_cliente', how='inner', suffixes=('', '_cliente'))
df_venta_fact_dim_clientes.head()

,id_venta,id_cliente,id_usuario,fecha,total,estado,descuento,sk_articulo,sk_cliente,nombre,tipo_persona
0,1,45,27,2021-03-25,10243.80,0,51.22,17,45,Kelly Wong,Juridica
1,310,45,47,2022-10-31,2727.37,1,27.27,2,45,Kelly Wong,Juridica
2,130,45,36,2023-06-24,22965.51,1,76.55,5,45,Kelly Wong,Juridica
3,163,45,17,2021-10-16,18863.30,1,94.32,30,45,Kelly Wong,Juridica
4,321,45,38,2023-01-08,15615.54,0,0.00,12,45,Kelly Wong,Juridica

In [98]:
df_venta_fact_dim_clientes.drop(columns=['id_cliente', 'nombre', 'tipo_persona'], axis=1, inplace=True)
df_venta_fact_dim_clientes.head()

,id_venta,id_usuario,fecha,total,estado,descuento,sk_articulo,sk_cliente
0,1,27,2021-03-25,10243.80,0,51.22,17,45
1,310,47,2022-10-31,2727.37,1,27.27,2,45
2,130,36,2023-06-24,22965.51,1,76.55,5,45
3,163,17,2021-10-16,18863.30,1,94.32,30,45
4,321,38,2023-01-08,15615.54,0,0.00,12,45

In [99]:
sql_query = 'SELECT * FROM dim_usuario;'
df_dim_usuarios = pd.read_sql(sql_query, mysql_driver)
df_dim_usuarios.head()

   sk_usuario  id_usuario          nombre estado         rol
0           1           1    Robert Silva      0  Supervisor
1           2           2     Taylor Hill      1  Supervisor
2           3           4   Jason Aguilar      1  Supervisor
3           4           7     Hunter Carr      1  Supervisor
4           5           9  William Martin      1  Supervisor

In [100]:
df_venta_fact_dim_usuarios = df_venta_fact_dim_clientes.merge(df_dim_usuarios, on='id_usuario', how='inner', suffixes=('', '_usuario'))
df_venta_fact_dim_usuarios.head()

,id_venta,id_usuario,fecha,total,estado,descuento,sk_articulo,sk_cliente,sk_usuario,nombre,estado_usuario,rol
0,1,27,2021-03-25,10243.80,0,51.22,17,45,11,Gabriella Duffy,1,Supervisor
1,299,27,2022-03-19,12051.06,1,0.00,1,37,11,Gabriella Duffy,1,Supervisor
2,161,27,2021-10-15,15310.34,0,0.00,9,55,11,Gabriella Duffy,1,Supervisor
3,103,27,2022-04-03,1365.66,1,6.83,19,61,11,Gabriella Duffy,1,Supervisor
4,131,27,2023-06-07,2727.37,0,0.00,22,61,11,Gabriella Duffy,1,Supervisor

In [101]:
df_venta_fact_dim_usuarios.drop(columns=['id_usuario', 'nombre', 'estado_usuario', 'rol'], axis=1, inplace=True)
df_venta_fact_dim_usuarios.head()

,id_venta,fecha,total,estado,descuento,sk_articulo,sk_cliente,sk_usuario
0,1,2021-03-25,10243.80,0,51.22,17,45,11
1,299,2022-03-19,12051.06,1,0.00,1,37,11
2,161,2021-10-15,15310.34,0,0.00,9,55,11
3,103,2022-04-03,1365.66,1,6.83,19,61,11
4,131,2023-06-07,2727.37,0,0.00,22,61,11

In [102]:
sql_query = 'SELECT * FROM dim_fecha;'
df_dim_fechas = pd.read_sql(sql_query, mysql_driver)
df_dim_fechas.head()

,id_date,full_date,year,month,quarter,day,week,day_of_week,day_name,weekday_flag,month_name
0,20200101,2020-01-01,2020,1,1,3,1,2,Wednesday,Weekday,January
1,20200102,2020-01-02,2020,1,1,4,1,3,Thursday,Weekday,January
2,20200103,2020-01-03,2020,1,1,5,1,4,Friday,Weekday,January
3,20200104,2020-01-04,2020,1,1,6,1,5,Saturday,Weekday,January
4,20200105,2020-01-05,2020,1,1,7,1,6,Sunday,Weekend,January

In [103]:
#len(df_venta_fact_dim_usuarios)
df_venta_fact_dim_fechas = pd.merge(df_venta_fact_dim_usuarios, df_dim_fechas, left_on='fecha', right_on='full_date', how='inner')
df_venta_fact_dim_fechas.head()

,id_venta,fecha,total,estado,descuento,sk_articulo,sk_cliente,sk_usuario,id_date,full_date,year,month,quarter,day,week,day_of_week,day_name,weekday_flag,month_name
0,1,2021-03-25,10243.80,0,51.22,17,45,11,20210325,2021-03-25,2021,3,1,4,12,3,Thursday,Weekday,March
1,126,2021-03-25,22890.63,1,0.00,11,33,3,20210325,2021-03-25,2021,3,1,4,12,3,Thursday,Weekday,March
2,299,2022-03-19,12051.06,1,0.00,1,37,11,20220319,2022-03-19,2022,3,1,6,11,5,Saturday,Weekday,March
3,161,2021-10-15,15310.34,0,0.00,9,55,11,20211015,2021-10-15,2021,10,4,5,41,4,Friday,Weekday,October
4,103,2022-04-03,1365.66,1,6.83,19,61,11,20220403,2022-04-03,2022,4,2,7,13,6,Sunday,Weekend,April

In [104]:
df_venta_fact_dim_fechas.drop(columns=['fecha', 'full_date', 'year', 'month', 'quarter', 'day', 'week', 'day_of_week', 'day_name', 'weekday_flag', 'month_name'], axis=1, inplace=True)
df_venta_fact_dim_fechas.head()

,id_venta,total,estado,descuento,sk_articulo,sk_cliente,sk_usuario,id_date
0,1,10243.80,0,51.22,17,45,11,20210325
1,126,22890.63,1,0.00,11,33,3,20210325
2,299,12051.06,1,0.00,1,37,11,20220319
3,161,15310.34,0,0.00,9,55,11,20211015
4,103,1365.66,1,6.83,19,61,11,20220403

In [105]:
df_venta_fact_dim_fechas.rename(columns={'id_date': 'id_fecha_venta'}, inplace=True)
ventaFact = df_venta_fact_dim_fechas
ventaFact.head()

,id_venta,total,estado,descuento,sk_articulo,sk_cliente,sk_usuario,id_fecha_venta
0,1,10243.80,0,51.22,17,45,11,20210325
1,126,22890.63,1,0.00,11,33,3,20210325
2,299,12051.06,1,0.00,1,37,11,20220319
3,161,15310.34,0,0.00,9,55,11,20211015
4,103,1365.66,1,6.83,19,61,11,20220403

### Insertamos los datos en la tabla de hechos

In [106]:
ventaFact.to_sql('venta_fact', mysql_driver, index=False, if_exists='append')

347